app/views/users/new.html.erb

SELECT "businesses".* FROM "businesses" ORDER BY "businesses"."company" ASC
---
<%= form_for @business do |f| %>
  Business Name(Select from drop-down or enter new business below): <%= f.collection_select :company, Business.order(:company),:id,:company, include_blank: true %>