app/controllers/businesses_controller.rb

  def create
    if params[:business][:company_field].length != 0 && params[:business][:company].length != 0
      @business = Business.create(company: params[:business][:company], company_field: params[:business][:company_field], phone_bus: params[:business][:phone_bus], address: params[:business][:address])
    end
    if params[:business][:users][:company] == ""
      business = Business.find_by(company: params[:business][:company])
      # p business.id
      @user = User.new(username: params[:business][:users][:username], email: params[:business][:users][:email], password: params[:business][:users][:password], password_confirmation: params[:business][:users][:password_confirmation], f_name: params[:business][:users][:f_name], l_name: params[:business][:users][:l_name], phone: params[:business][:users][:phone], title: params[:business][:users][:title], business_id: business.id)
      # p @user.business_id = business.id
    else
      @user = User.new(username: params[:business][:users][:username], email: params[:business][:users][:email], password: params[:business][:users][:password], password_confirmation: params[:business][:users][:password_confirmation], f_name: params[:business][:users][:f_name], l_name: params[:business][:users][:l_name], phone: params[:business][:users][:phone], title: params[:business][:users][:title], business_id: params[:business][:users][:company])
    end
    if @user.save
---
SELECT  "businesses".* FROM "businesses" WHERE "businesses"."company" = $1 LIMIT $2  [["company", ""], ["LIMIT", 1]]
INSERT INTO "businesses" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", 2017-02-27 22:01:44 UTC], ["updated_at", 2017-02-27 22:01:44 UTC]]
INSERT INTO "users" ("username", "f_name", "l_name", "email", "password_digest", "title", "phone", "business_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"